backend/app/Controllers/Products.php

SELECT *
FROM `products`
---
    public function index()
    {
        $model = new ProductModel();
        $data = $model->findAll();

SELECT *
FROM `products`
WHERE `products`.`id` IN ('1')
---
    public function show($id = null)
    {
        $model = new ProductModel();
        $data = $model->find(['id' => $id]);